def perimeter(a, b):
    '''
        Вычисляет периметр прямоугольника по заданным величинам.
        Параметры:
        a, b(float, int): длины сторон
        Возвращаемое значение:
        float: периметр прямоугольника
        '''
    return (a + b) * 2


def area(a, b):
    '''
        Вычисляет площадь прямоугольника по заданным величинам.
        Параметры:
        a, b(float, int): длины сторон
        Возвращаемое значение:
        float: площадь прямоугольника
        '''
    return a * b

