
def area(a, h):
    '''
        Вычисляет площадь треугольника по заданным величинам.
        Параметры:
        a(float, int): длина стороны
        h(float, int): высота, опущенная на сторону a
        Возвращаемое значение:
        float: площадь треугольника
        '''
    return a * h / 2


def perimeter(a, b, c):
    '''
        Вычисляет периметр треугольника по заданным сторонам.
        Параметры:
        a(float, int): длина стороны
        b(float, int): длина стороны
        c(float, int): длина стороны
        Возвращаемое значение:
        float: площадь прямоугольника
        '''
    return a + b + c
